# Import relevant libraries

In [2]:
import pandas as pd
import numpy as np
import country_converter as coco
import nltk
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.figure_factory as ff
import plotly.graph_objects as go
from wordcloud import WordCloud

%matplotlib inline

# 1. Load data

In [10]:
df = pd.read_csv('C:/Users/Pc/OneDrive/Escritorio/Datasets/Data Salaries/ds_salaries.csv')

df.drop(df[['salary', 'salary_currency']], 
        axis=1,
       inplace=True)

df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,CA,100,CA,M

In [13]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

There is no missing values to deal with.

About the dataset, we'll have to deal with the following columns:

    - 3 numeric columns: work_year, salary_in_usd and remote_ratio
    - 6 categorical columns: experience_level, employment_type, job_title, employee_residence, company_location and company_size

# 2. Univariate analysis